Model 5

Business question: How full are cinemas on average? Who's underperforming or performing best?


Takeaways: Highlights underperforming cinemas with consistently low occupancy, helping identify opportunities to optimize scheduling, marketing, or capacity management.

In [1]:
import duckdb

In [2]:
conn = duckdb.connect('c:/Users/Fgllc/OneDrive/Escritorio/USC/etl_project/cinema_tickets.duckdb')
conn

In [3]:
conn.execute('SHOW TABLES').fetchall()

[('base_model',),
 ('cinema_tickets',),
 ('fifth_model',),
 ('fourth_model',),
 ('master_model',),
 ('second_model',),
 ('seventh_model',),
 ('sixth_model',),
 ('third_model',)]

In [4]:
query = """
SELECT 
    cinema_code,
    ROUND(AVG(occu_perc), 2) AS avg_occupancy
FROM master_model
GROUP BY cinema_code
ORDER BY avg_occupancy DESC
"""

conn.execute(query).fetchdf()

     cinema_code  avg_occupancy
0            474          64.01
1            390          58.79
2             35          45.87
3            485          45.15
4            316          40.28
..           ...            ...
241          458           0.81
242          215           0.36
243          557           0.00
244          543            NaN
245          637            NaN

[246 rows x 2 columns]

This model helps out identifying how well the cinemas are utilizing their available seating. 

Low numbers → poor attendance (opportunity to investigate why).

Higher numbers → better performance (could double down on marketing or scheduling similar films)

In [5]:
#checking if model works
fifth_model = """
SELECT *
FROM fifth_model
ORDER BY avg_occupancy DESC
"""

conn.execute(fifth_model).fetchdf().head(10)

   cinema_code  avg_occupancy
0          474          64.01
1          390          58.79
2           35          45.87
3          485          45.15
4          316          40.28
5          304          40.24
6          430          40.01
7          524          39.61
8          456          39.42
9          497          38.13

In [6]:
conn.close()